---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCSlopedFlange
source: html/77c44ed4-9bda-1174-a07f-9eb0831697a4.htm
---
# StructuralSectionCSlopedFlange Members

Creates a new instance of Structural Section C Sloped Flange shape with the associated set of parameters,
 used to attach to structural element.